### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] has changed
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ identity {
          ~ principal_id = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_key_vault_access_policy.func_profas_staging must be replaced
-/+ resource "azurerm_key_vault_access_policy" "func_profas_staging" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-citizen-auth-sec-rg/providers/Microsoft.KeyVault/vaults/io-p-citizen-auth-kv/objectId/6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> (known after apply)
      - key_permissions         = [] -> null
      ~ object_id               = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2" # forces replacement
      - storage_permissions     = [] -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_key_vault_access_policy.kv_common_func_profas_staging must be replaced
-/+ resource "azurerm_key_vault_access_policy" "kv_common_func_profas_staging" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common/objectId/6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> (known after apply)
      - key_permissions         = [] -> null
      ~ object_id               = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2" # forces replacement
      - storage_permissions     = [] -> null
        # (4 unchanged attributes hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "IOPSTAPP_STORAGE_CONNECTION_STRING"                                                               = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/maintenance-st-connection-string)" -> null
            # (59 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02"
        name                                           = "io-p-itn-auth-profas-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "5" -> "100"
          ~ "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "5" -> "100"
          ~ "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "5" -> "100"
          ~ "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "5" -> "100"
          + "AzureFunctionsWebHost__hostid"                                                                    = "staging"
          ~ "AzureWebJobs.ExpiredSessionAdvisor.Disabled"                                                      = "0" -> "1"
          ~ "AzureWebJobs.ExpiredSessionsDiscoverer.Disabled"                                                  = "0" -> "1"
          ~ "AzureWebJobs.MigrateServicePreferenceFromLegacy.Disabled"                                         = "0" -> "1"
          ~ "AzureWebJobs.OnProfileUpdate.Disabled"                                                            = "0" -> "1"
          ~ "AzureWebJobs.SessionNotificationEventsProcessor.Disabled"                                         = "0" -> "1"
          ~ "AzureWebJobs.SessionNotificationsInitRecovery.Disabled"                                           = "0" -> "1"
          ~ "AzureWebJobs.StoreSpidLogs.Disabled"                                                              = "0" -> "1"
          - "IOPSTAPP_STORAGE_CONNECTION_STRING"                                                               = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/maintenance-st-connection-string)" -> null
          ~ "SLOT_TASK_HUBNAME"                                                                                = "ProductionTaskHub" -> "StagingTaskHub"
            # (47 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_profile_async.azurerm_role_assignment.staging_function_storage_account_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_account_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthprofasstfn02/providers/Microsoft.Authorization/roleAssignments/7ffb71a0-baf3-3c4d-aafd-0b8f3e8bd4fe" -> (known after apply)
      ~ name                                   = "7ffb71a0-baf3-3c4d-aafd-0b8f3e8bd4fe" -> (known after apply)
      ~ principal_id                           = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.function_profile_async.azurerm_role_assignment.staging_function_storage_blob_data_owner[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_blob_data_owner" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthprofasstfn02/providers/Microsoft.Authorization/roleAssignments/f24d84a9-f2b9-53fe-c6c7-ed0d71ab2512" -> (known after apply)
      ~ name                                   = "f24d84a9-f2b9-53fe-c6c7-ed0d71ab2512" -> (known after apply)
      ~ principal_id                           = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.function_profile_async.azurerm_role_assignment.staging_function_storage_queue_data_contributor[0] must be replaced
-/+ resource "azurerm_role_assignment" "staging_function_storage_queue_data_contributor" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnauthprofasstfn02/providers/Microsoft.Authorization/roleAssignments/fac68783-bb78-cbd7-092a-8c15dd73d9e2" -> (known after apply)
      ~ name                                   = "fac68783-bb78-cbd7-092a-8c15dd73d9e2" -> (known after apply)
      ~ principal_id                           = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sub_io_prof_async_staging.module.service_bus.azurerm_role_assignment.subscriptions["/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01|io-auth-sessions-topic|io-session-notifications-sub|reader"] must be replaced
-/+ resource "azurerm_role_assignment" "subscriptions" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ServiceBus/namespaces/io-p-itn-platform-sbns-01/topics/io-auth-sessions-topic/subscriptions/io-session-notifications-sub/providers/Microsoft.Authorization/roleAssignments/06086250-4269-e65f-a32b-b30fd042e49d" -> (known after apply)
      ~ name                                   = "06086250-4269-e65f-a32b-b30fd042e49d" -> (known after apply)
      ~ principal_id                           = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4f6d3b9b-027b-4f4c-9142-0e5a2a2247e0" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.iam_kv.module.kv_func["io-p-itn-auth-profas-func-02-st"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-auth-main-rg-01|io-p-itn-auth-kv-01|reader"] must be replaced
-/+ resource "azurerm_role_assignment" "secrets" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01/providers/Microsoft.Authorization/roleAssignments/589a6b44-8515-0a7f-00b2-ce73850d8d5a" -> (known after apply)
      ~ name                                   = "589a6b44-8515-0a7f-00b2-ce73850d8d5a" -> (known after apply)
      ~ principal_id                           = "6af06a8e-d9b4-458a-a02f-eee8bd87081e" -> "c60e62e1-05cb-43d0-a958-9b75153184d2" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 7 to destroy.
```

</details>
